## Import Pandas

Name: Mohammad Aziz
, Student ID: 20192233

In [ ]:
# write code here

In [2]:
import pandas as pd

## Read in the Salary CSV data

*  hint Make sure the slary.csv file is inthesame location as you notebook
*  you may wish to write something like `df = pd.read_csv("filename.csv")`

In [3]:
df=pd.read_csv("Salaries.csv")

/home/gambler/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

* Use this code to check the first 5 rows of your imported data `df.head()`

In [3]:
df.head(5)

,Id,EmployeeName,JobTitle,BasePay
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402

> #### Drop all missing data using `df.dropna(inplace=True)`

In [4]:
df.dropna(inplace=True)

In [5]:
df.isnull().sum()

Id              0
EmployeeName    0
JobTitle        0
BasePay         0
dtype: int64

> ### Checking the datatypes

In [11]:
df.dtypes

Id                int64
EmployeeName     object
JobTitle         object
BasePay         float64
dtype: object

> ### use this code to Convert the `BasePay` column to numeric data

In [12]:
df["BasePay"] = pd.to_numeric(df["BasePay"],errors = 'coerce')

In [13]:
df.dtypes

Id                int64
EmployeeName     object
JobTitle         object
BasePay         float64
dtype: object

>###  Task Check the mean of the `BasePay`... Checking the mean salary

In [24]:
df[['BasePay']].mean(axis=0)

BasePay    66325.448841
dtype: float64

>###  Check who had the Highest Salary

In [21]:
df[['EmployeeName', 'BasePay']].max()

EmployeeName    Zuri Jones
BasePay             319275
dtype: object

>### Who had the Lowest Salary

In [22]:
df[['EmployeeName', 'BasePay']].min()

EmployeeName    A BERNARD FATOOH
BasePay                  -166.01
dtype: object